In [200]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(

    {"a" : [1,3,5,66,65],
     "b" : [3 , 5 , 6 , 5 ,6],
     "c" : ["a" , "b" , "v" , "c" , "x" ]
     
     } , 

     index = [1,2,3,4,5]
 

)
df

    a  b  c
1   1  3  a
2   3  5  b
3   5  6  v
4  66  5  c
5  65  6  x

In [5]:
df = pd.DataFrame(
    [
        [2,3,4] , 
        [4,7,8]

    ] , 
    index = [1,2]
    ,
    columns=["a" , "b" , "c"]

)

df

   a  b  c
1  2  3  4
2  4  7  8

In [150]:
person = { 'name':['Oumaima', 'Reda' , 'Mounia' , ' Jamal'] , 
          'age': [24, 34, 50 , 45 ] }

In [151]:
df = pd.DataFrame(person , index=[1,2,3,4])
df

      name  age
1  Oumaima   24
2     Reda   34
3   Mounia   50
4    Jamal   45

In [152]:
df['job'] = ["pilot" , "cuisinier" , "chef" , "musician"]
df

      name  age        job
1  Oumaima   24      pilot
2     Reda   34  cuisinier
3   Mounia   50       chef
4    Jamal   45   musician

In [153]:
hobby = ["nage" , "hiking" , "chanter" , "dessiner"]
df['hobby'] = pd.Series(hobby)
df

      name  age        job     hobby
1  Oumaima   24      pilot    hiking
2     Reda   34  cuisinier   chanter
3   Mounia   50       chef  dessiner
4    Jamal   45   musician       NaN

In [154]:
df['name']

1    Oumaima
2       Reda
3     Mounia
4      Jamal
Name: name, dtype: object

In [155]:
df[['name' , 'age']]

      name  age
1  Oumaima   24
2     Reda   34
3   Mounia   50
4    Jamal   45

In [156]:
df

      name  age        job     hobby
1  Oumaima   24      pilot    hiking
2     Reda   34  cuisinier   chanter
3   Mounia   50       chef  dessiner
4    Jamal   45   musician       NaN

In [45]:
df.loc[1:4 , "name" ]

1    Oumaima
2       Reda
3     Mounia
4      Jamal
Name: name, dtype: object

In [46]:
df

      name  age       job     hobby
1  Oumaima   24    hiking    hiking
2     Reda   34   chanter   chanter
3   Mounia   50  dessiner  dessiner
4    Jamal   45       NaN       NaN

In [48]:
df.sort_index()

      name  age       job     hobby
1  Oumaima   24    hiking    hiking
2     Reda   34   chanter   chanter
3   Mounia   50  dessiner  dessiner
4    Jamal   45       NaN       NaN

In [49]:
df

      name  age       job     hobby
1  Oumaima   24    hiking    hiking
2     Reda   34   chanter   chanter
3   Mounia   50  dessiner  dessiner
4    Jamal   45       NaN       NaN

In [64]:
df_age = df['age'] > 24
df_age

1    False
2     True
3     True
4     True
Name: age, dtype: bool

In [66]:
df.loc[ df_age , ["job"]]

        job
2   chanter
3  dessiner
4       NaN

In [67]:
df

      name  age       job     hobby
1  Oumaima   24    hiking    hiking
2     Reda   34   chanter   chanter
3   Mounia   50  dessiner  dessiner
4    Jamal   45       NaN       NaN

In [84]:
df.columns.str.lower()

Index(['name', 'age', 'job', 'hobby'], dtype='object')

In [116]:

df_lower = df.applymap(lambda s: s.lower() if type(s) == str else s)
    

df_lower

      name  age       job     hobby
1  oumaima   24    hiking    hiking
2     reda   34   chanter   chanter
3   mounia   50  dessiner  dessiner
4    jamal   45       NaN       NaN

In [124]:
df_name_a = df['name'].str.contains('o')
df_name_a

1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [157]:
df = df.applymap(lambda s: s.lower() if type(s) == str else s)
df

      name  age        job     hobby
1  oumaima   24      pilot    hiking
2     reda   34  cuisinier   chanter
3   mounia   50       chef  dessiner
4    jamal   45   musician       NaN

In [136]:
df.columns = ["first_name" , "age" , "job" , "hobby"]
df

  first_name  age       job     hobby
1    oumaima   24    hiking    hiking
2       reda   34   chanter   chanter
3     mounia   50  dessiner  dessiner
4      jamal   45       NaN       NaN

Index(['FIRST_NAME', 'AGE', 'JOB', 'HOBBY'], dtype='object')

In [162]:
df.columns = [x.upper() for x in df.columns]

In [163]:
df

      NAME  AGE        JOB     HOBBY
1  oumaima   24      pilot    hiking
2     reda   34  cuisinier   chanter
3   mounia   50       chef  dessiner
4    jamal   45   musician       NaN

In [164]:
df.columns = df.columns.str.lower()
df

      name  age        job     hobby
1  oumaima   24      pilot    hiking
2     reda   34  cuisinier   chanter
3   mounia   50       chef  dessiner
4    jamal   45   musician       NaN

In [174]:
df = df.rename(columns={'name' : "first-name"})
df

  first-name  age        job     hobby
1    oumaima   24      pilot    hiking
2       reda   34  cuisinier   chanter
3     mounia   50       chef  dessiner
4      jamal   45   musician       NaN

In [175]:
df.columns

Index(['first-name', 'age', 'job', 'hobby'], dtype='object')

In [176]:
df.columns = df.columns.str.replace('-' , '_')
df

  first_name  age        job     hobby
1    oumaima   24      pilot    hiking
2       reda   34  cuisinier   chanter
3     mounia   50       chef  dessiner
4      jamal   45   musician       NaN

In [179]:
df.columns = [x.replace('_','-') for x in df.columns]
df

  first-name  age        job     hobby
1    oumaima   24      pilot    hiking
2       reda   34  cuisinier   chanter
3     mounia   50       chef  dessiner
4      jamal   45   musician       NaN

In [188]:
df.loc[1 , ['age' , 'job']] = [50, "software"]
df

  first-name  age       job     hobby
1    oumaima   50  software    hiking
2       reda   34   teacher   chanter
3     mounia   50      chef  dessiner
4      jamal   45  musician       NaN

In [190]:
df['travel_destination'] = ["france" , "spain" , "japan" , "mexique"]
df

  first-name  age       job     hobby travel_destination
1    oumaima   50  software    hiking             france
2       reda   34   teacher   chanter              spain
3     mounia   50      chef  dessiner              japan
4      jamal   45  musician       NaN            mexique

In [191]:

df['job'] = df['job'].str.upper()

In [192]:
df

  first-name  age       job     hobby travel_destination
1    oumaima   50  SOFTWARE    hiking             france
2       reda   34   TEACHER   chanter              spain
3     mounia   50      CHEF  dessiner              japan
4      jamal   45  MUSICIAN       NaN            mexique

In [193]:
def categories(age):
    if age < 20:
        return '0'
    elif (age >= 20 ) & (age < 30):
        return '1'
    elif (age >= 30) & (age <40) :
        return '2'
    else :
        return  '3'

In [199]:
df_resultat = df['age'].apply(categories)
df_resultat

1    0
2    0
3    0
4    0
Name: age, dtype: object

  first-name  age       job     hobby travel_destination
1    oumaima   12  SOFTWARE    hiking             france
2       reda   12   TEACHER   chanter              spain
3     mounia   12      CHEF  dessiner              japan
4      jamal   12  MUSICIAN       NaN            mexique

In [201]:
print(dir(np))

['ALLOW_THREADS', 'AxisError', 'BUFSIZE', 'CLIP', 'ComplexWarning', 'DataSource', 'ERR_CALL', 'ERR_DEFAULT', 'ERR_IGNORE', 'ERR_LOG', 'ERR_PRINT', 'ERR_RAISE', 'ERR_WARN', 'FLOATING_POINT_SUPPORT', 'FPE_DIVIDEBYZERO', 'FPE_INVALID', 'FPE_OVERFLOW', 'FPE_UNDERFLOW', 'False_', 'Inf', 'Infinity', 'MAXDIMS', 'MAY_SHARE_BOUNDS', 'MAY_SHARE_EXACT', 'ModuleDeprecationWarning', 'NAN', 'NINF', 'NZERO', 'NaN', 'PINF', 'PZERO', 'RAISE', 'RankWarning', 'SHIFT_DIVIDEBYZERO', 'SHIFT_INVALID', 'SHIFT_OVERFLOW', 'SHIFT_UNDERFLOW', 'ScalarType', 'Tester', 'TooHardError', 'True_', 'UFUNC_BUFSIZE_DEFAULT', 'UFUNC_PYVALS_NAME', 'VisibleDeprecationWarning', 'WRAP', '_CopyMode', '_NoValue', '_UFUNC_API', '__NUMPY_SETUP__', '__all__', '__builtins__', '__cached__', '__config__', '__deprecated_attrs__', '__dir__', '__doc__', '__expired_functions__', '__file__', '__future_scalars__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_add_newdoc_ufunc', '_distributor_init', '_financial_names', '_get_promotion_state', '_globals', '_mat', '_no_nep50_warning', '_pyinstaller_hooks_dir', '_pytesttester', '_set_promotion_state', '_version', 'abs', 'absolute', 'add', 'add_docstring', 'add_newdoc', 'add_newdoc_ufunc', 'all', 'allclose', 'alltrue', 'amax', 'amin', 'angle', 'any', 'append', 'apply_along_axis', 'apply_over_axes', 'arange', 'arccos', 'arccosh', 'arcsin', 'arcsinh', 'arctan', 'arctan2', 'arctanh', 'argmax', 'argmin', 'argpartition', 'argsort', 'argwhere', 'around', 'array', 'array2string', 'array_equal', 'array_equiv', 'array_repr', 'array_split', 'array_str', 'asanyarray', 'asarray', 'asarray_chkfinite', 'ascontiguousarray', 'asfarray', 'asfortranarray', 'asmatrix', 'atleast_1d', 'atleast_2d', 'atleast_3d', 'average', 'bartlett', 'base_repr', 'binary_repr', 'bincount', 'bitwise_and', 'bitwise_not', 'bitwise_or', 'bitwise_xor', 'blackman', 'block', 'bmat', 'bool_', 'broadcast', 'broadcast_arrays', 'broadcast_shapes', 'broadcast_to', 'busday_count', 'busday_offset', 'busdaycalendar', 'byte', 'byte_bounds', 'bytes_', 'c_', 'can_cast', 'cast', 'cbrt', 'cdouble', 'ceil', 'cfloat', 'char', 'character', 'chararray', 'choose', 'clip', 'clongdouble', 'clongfloat', 'column_stack', 'common_type', 'compare_chararrays', 'compat', 'complex128', 'complex64', 'complex_', 'complexfloating', 'compress', 'concatenate', 'conj', 'conjugate', 'convolve', 'copy', 'copysign', 'copyto', 'corrcoef', 'correlate', 'cos', 'cosh', 'count_nonzero', 'cov', 'cross', 'csingle', 'ctypeslib', 'cumprod', 'cumproduct', 'cumsum', 'datetime64', 'datetime_as_string', 'datetime_data', 'deg2rad', 'degrees', 'delete', 'deprecate', 'deprecate_with_doc', 'diag', 'diag_indices', 'diag_indices_from', 'diagflat', 'diagonal', 'diff', 'digitize', 'disp', 'divide', 'divmod', 'dot', 'double', 'dsplit', 'dstack', 'dtype', 'e', 'ediff1d', 'einsum', 'einsum_path', 'emath', 'empty', 'empty_like', 'equal', 'error_message', 'errstate', 'euler_gamma', 'exp', 'exp2', 'expand_dims', 'expm1', 'extract', 'eye', 'fabs', 'fastCopyAndTranspose', 'fft', 'fill_diagonal', 'find_common_type', 'finfo', 'fix', 'flatiter', 'flatnonzero', 'flexible', 'flip', 'fliplr', 'flipud', 'float16', 'float32', 'float64', 'float_', 'float_power', 'floating', 'floor', 'floor_divide', 'fmax', 'fmin', 'fmod', 'format_float_positional', 'format_float_scientific', 'format_parser', 'frexp', 'from_dlpack', 'frombuffer', 'fromfile', 'fromfunction', 'fromiter', 'frompyfunc', 'fromregex', 'fromstring', 'full', 'full_like', 'gcd', 'generic', 'genfromtxt', 'geomspace', 'get_array_wrap', 'get_include', 'get_printoptions', 'getbufsize', 'geterr', 'geterrcall', 'geterrobj', 'gradient', 'greater', 'greater_equal', 'half', 'hamming', 'hanning', 'heaviside', 'histogram', 'histogram2d', 'histogram_bin_edges', 'histogramdd', 'hsplit', 'hstack', 'hypot', 'i0', 'identity', 'iinfo', 'imag', 'in1d', 'index_exp', 'indices', 'inexact', 'inf', 'info', 'infty', 'inner', 'insert', 'int16', 'int32', 'int64', 'int8', 'int_', 'intc', 'integer', 'interp', 'intersect1d', 'intp', 'invert', 'is_busday', 'isclose', 'iscomplex', 'iscomplexobj', 'isfinite', 'isfortran', 'isin', 'isinf', 'isnan', 'isnat', 'isneginf', 'isposinf', 'isreal', 'isrealobj', 'isscalar', 'issctype', 'issubclass_', 'issubdtype', 'issubsctype', 'iterable', 'ix_', 'kaiser', 'kron', 'lcm', 'ldexp', 'left_shift', 'less', 'less_equal', 'lexsort', 'lib', 'linalg', 'linspace', 'little_endian', 'load', 'loadtxt', 'log', 'log10', 'log1p', 'log2', 'logaddexp', 'logaddexp2', 'logical_and', 'logical_not', 'logical_or', 'logical_xor', 'logspace', 'longcomplex', 'longdouble', 'longfloat', 'longlong', 'lookfor', 'ma', 'mask_indices', 'mat', 'math', 'matmul', 'matrix', 'max', 'maximum', 'maximum_sctype', 'may_share_memory', 'mean', 'median', 'memmap', 'meshgrid', 'mgrid', 'min', 'min_scalar_type', 'minimum', 'mintypecode', 'mod', 'modf', 'moveaxis', 'msort', 'multiply', 'nan', 'nan_to_num', 'nanargmax', 'nanargmin', 'nancumprod', 'nancumsum', 'nanmax', 'nanmean', 'nanmedian', 'nanmin', 'nanpercentile', 'nanprod', 'nanquantile', 'nanstd', 'nansum', 'nanvar', 'nbytes', 'ndarray', 'ndenumerate', 'ndim', 'ndindex', 'nditer', 'negative', 'nested_iters', 'newaxis', 'nextafter', 'nonzero', 'not_equal', 'numarray', 'number', 'obj2sctype', 'object_', 'ogrid', 'oldnumeric', 'ones', 'ones_like', 'outer', 'packbits', 'pad', 'partition', 'percentile', 'pi', 'piecewise', 'place', 'poly', 'poly1d', 'polyadd', 'polyder', 'polydiv', 'polyfit', 'polyint', 'polymul', 'polynomial', 'polysub', 'polyval', 'positive', 'power', 'printoptions', 'prod', 'product', 'promote_types', 'ptp', 'put', 'put_along_axis', 'putmask', 'quantile', 'r_', 'rad2deg', 'radians', 'random', 'ravel', 'ravel_multi_index', 'real', 'real_if_close', 'rec', 'recarray', 'recfromcsv', 'recfromtxt', 'reciprocal', 'record', 'remainder', 'repeat', 'require', 'reshape', 'resize', 'result_type', 'right_shift', 'rint', 'roll', 'rollaxis', 'roots', 'rot90', 'round', 'round_', 'row_stack', 's_', 'safe_eval', 'save', 'savetxt', 'savez', 'savez_compressed', 'sctype2char', 'sctypeDict', 'sctypes', 'searchsorted', 'select', 'set_numeric_ops', 'set_printoptions', 'set_string_function', 'setbufsize', 'setdiff1d', 'seterr', 'seterrcall', 'seterrobj', 'setxor1d', 'shape', 'shares_memory', 'short', 'show_config', 'show_runtime', 'sign', 'signbit', 'signedinteger', 'sin', 'sinc', 'single', 'singlecomplex', 'sinh', 'size', 'sometrue', 'sort', 'sort_complex', 'source', 'spacing', 'split', 'sqrt', 'square', 'squeeze', 'stack', 'std', 'str_', 'string_', 'subtract', 'sum', 'swapaxes', 'take', 'take_along_axis', 'tan', 'tanh', 'tensordot', 'test', 'testing', 'tile', 'timedelta64', 'trace', 'tracemalloc_domain', 'transpose', 'trapz', 'tri', 'tril', 'tril_indices', 'tril_indices_from', 'trim_zeros', 'triu', 'triu_indices', 'triu_indices_from', 'true_divide', 'trunc', 'typecodes', 'typename', 'ubyte', 'ufunc', 'uint', 'uint16', 'uint32', 'uint64', 'uint8', 'uintc', 'uintp', 'ulonglong', 'unicode_', 'union1d', 'unique', 'unpackbits', 'unravel_index', 'unsignedinteger', 'unwrap', 'use_hugepage', 'ushort', 'vander', 'var', 'vdot', 'vectorize', 'version', 'void', 'vsplit', 'vstack', 'w', 'where', 'who', 'zeros', 'zeros_like']